       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. V1TOV2.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT V1FILE ASSIGN "v1.dat"
           ORGANIZATION LINE SEQUENTIAL.
       SELECT V2FILE ASSIGN "v2.dat"
           ORGANIZATION IS INDEXED 
           ACCESS MODE IS RANDOM 
           RECORD KEY IS IMDBID OF V2FILERECORD.

DATA DIVISION.
FILE SECTION.
       FD V1FILE.
       01 V1FILERECORD.
          88 ENDOFFILE VALUE HIGH-VALUES.
          02 IMDBID PIC X(9) VALUE SPACES.
          02 MovieTitle PIC X(120) VALUE SPACES.
          02 HaveWatched PIC X(10) VALUE SPACES.
          02 Rating PIC X(15) VALUE SPACES.
          02 CATEGORY PIC X(30) VALUE SPACES.
       FD V2FILE.
       01 V2FILERECORD.
          02 IMDBID PIC X(9) VALUE SPACES.
          02 MovieTitle PIC X(120) VALUE SPACES.
          02 HaveWatched PIC X(10) VALUE SPACES.
          02 Rating PIC X(15) VALUE SPACES.
          02 CATEGORY PIC X(30) VALUE SPACES.
          

WORKING-STORAGE SECTION.
       01 SCRATCHPAD.
          02 IMDBID PIC X(9).

PROCEDURE DIVISION.
       OPEN INPUT V1FILE
       OPEN OUTPUT V2FILE
       READ V1FILE
           AT END SET ENDOFFILE TO TRUE
       END-READ
       PERFORM UNTIL ENDOFFILE
           WRITE V2FILERECORD FROM V1FILERECORD
               INVALID KEY DISPLAY IMDBID OF V1FILERECORD
           END-WRITE
           READ V1FILE
               AT END SET ENDOFFILE TO TRUE
           END-READ
       END-PERFORM
       CLOSE V1FILE, V2FILE
       STOP RUN.

DUMPRECORD.
       DISPLAY "**************************"
       DISPLAY "IMDBID: " IMDBID OF V1FILERECORD
       DISPLAY "TITLE: " MOVIETITLE OF V1FILERECORD
       DISPLAY "WATCHED: " HAVEWATCHED OF V1FILERECORD
       DISPLAY "RATING: " RATING OF V1FILERECORD
       DISPLAY "CATEGORY: " Category OF V1FILERECORD
       EXIT.

