       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. VHSMANAGE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
       SELECT V2FILE ASSIGN "v2.dat"
           ORGANIZATION IS INDEXED 
           ACCESS MODE IS DYNAMIC 
           RECORD KEY IS IMDBID OF V2FILERECORD.

DATA DIVISION.
FILE SECTION.
       FD V2FILE.
       01 V2FILERECORD.
          88 ENDOFFILE VALUE HIGH-VALUE.
          02 IMDBID PIC X(9) VALUE SPACES.
          02 MOVIETITLE PIC X(120) VALUE SPACES.
          02 HAVEWATCHED PIC X(10) VALUE SPACES.
          02 RATING PIC X(15) VALUE SPACES.
          02 CATEGORY PIC X(30) VALUE SPACES.

WORKING-STORAGE SECTION.
       01 SCRATCHPAD.
          02 COMMAND PIC X.
             88 ISQUITCOMMAND VALUE "q", "Q".
             
PROCEDURE DIVISION.

MAINMENU.
       DISPLAY SPACE
       DISPLAY "VHS MANAGER"
       DISPLAY "[Q]UIT"
       ACCEPT COMMAND
       IF ISQUITCOMMAND THEN 
           STOP RUN
       END-IF

       GO TO MAINMENU.

