       >>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. OHAI.

DATA DIVISION.
       WORKING-STORAGE SECTION.

PROCEDURE DIVISION.
       DISPLAY "OHAI!"
STOP RUN.
